In [2]:
import pandas as pd

#Create empty dataFrame
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []
Empty DataFrame
Columns: []
Index: []

In [ ]:
list_data = ['one', 'two', 'three', 'four', 'five']
df = pd.DataFrame(data=list_data)

df

       0
0    one
1    two
2  three
3   four
4   five

In [4]:
list_of_lists = [['Clara', 25], ['Marta', 27], ['Laura', 29]]

df_list= pd.DataFrame(data=list_of_lists)

df_list

       0   1
0  Clara  25
1  Marta  27
2  Laura  29

In [5]:
column_names = ['Name', 'Age']
row_names = ['Student 1', 'Student 2', 'Student 3']


df_list = pd.DataFrame(data=list_of_lists, columns=column_names, index=row_names)

df_list

            Name  Age
Student 1  Clara   25
Student 2  Marta   27
Student 3  Laura   29

In [6]:
#DataFrame from a dictonary of lists

dict_list = [['A', 'B', 'C', 'D'], [28, 34, 29, 38]]
df_dict = pd.DataFrame(data=dict_list)

df_dict

    0   1   2   3
0   A   B   C   D
1  28  34  29  38

In [7]:
#DataFrame from a dictonary

dict = {'names': ['A', 'B', 'C', 'D'], 'age': [28, 34, 29, 38]}
df_dict = pd.DataFrame(data=dict)

df_dict

  names  age
0     A   28
1     B   34
2     C   29
3     D   38

In [8]:
type(df_dict)

pandas.core.frame.DataFrame

In [9]:
#check if we hace the same number of rows and row labels

row_names = ['Student 1', 'Student 2', 'Student 3']
len(row_names) == len(df_dict['names'])

False

In [10]:
#Dictionary keys are taken by default as column names

list_dict_2 = [{'a':1, 'b':2}, {'a': 3, 'b': 4, 'c': 7}]
list_dic_dataFrame = pd.DataFrame(data=list_dict_2)

list_dic_dataFrame

   a  b    c
0  1  2  NaN
1  3  4  7.0

In [11]:
list_dic_dataFrame_row_names = pd.DataFrame(data=list_dict_2, index=['first', 'second'])

list_dic_dataFrame_row_names

        a  b    c
first   1  2  NaN
second  3  4  7.0

In [12]:
# Choose columns to include in my DataFrame

df2 = pd.DataFrame(data=list_dict_2, index=['first', 'second'], columns=['a', 'b', 'z'])

df2 #it's NaN for column Z bc it doesn't exist

        a  b   z
first   1  2 NaN
second  3  4 NaN

In [13]:
#check the index

df2.index

Index(['first', 'second'], dtype='object')

In [14]:
#check the columns

df2.columns

Index(['a', 'b', 'z'], dtype='object')

In [15]:
df2.columns = ['first_colunn', 'second_column', 'third column']

df2

        first_colunn  second_column  third column
first              1              2           NaN
second             3              4           NaN

In [16]:
d = {'one': pd.Series([10,12,3], index=['row1', 'row2', 'row3']),
    'two': pd.Series([15.0, 2.0, 4.45], index=['row1', 'row2', 'row3'])}

df = pd.DataFrame(d)
df

      one    two
row1   10  15.00
row2   12   2.00
row3    3   4.45

In [17]:
df.dtypes

one      int64
two    float64
dtype: object

In [18]:
#row names
df.index

Index(['row1', 'row2', 'row3'], dtype='object')

In [19]:
#column names
df.columns

Index(['one', 'two'], dtype='object')

In [20]:
#axis attributes (combination row + columns)
df.axes

[Index(['row1', 'row2', 'row3'], dtype='object'),
 Index(['one', 'two'], dtype='object')]

In [21]:
#number of dimensions
df.ndim

2

In [22]:
#size of the content(nuber of elements)
df.size

6

In [23]:
#tuple of number of rows and columns
df.shape

(3, 2)

In [24]:
#values of the content (an array)
df.values

array([[10.  , 15.  ],
       [12.  ,  2.  ],
       [ 3.  ,  4.45]])

In [25]:
#type of the dataframe
type(df)

pandas.core.frame.DataFrame

In [26]:
#available methods
dir(pd.core.frame.DataFrame)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__arrow_c_stream__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__dataframe__',
 '__dataframe_consortium_standard__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pandas_priority__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_for_op',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_arith_method_with_reindex',
 '_as_manager',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_from_mgr',
 '_constructor_sliced',
 '_constructor_sliced_from_mgr',
 '_create_data_for_split_and_tight_to_dict',
 '_data',
 '_deprecate_downcast',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flex_arith_method',
 '_flex_cmp_method',
 '_from_arrays',
 '_from_mgr',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values_for_csv',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_getitem_nocopy',
 '_getitem_slice',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_is_view_after_cow_rules',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_iter_column_arrays',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_maybe_align_series_as_frame',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_pad_or_backfill',
 '_protect_consolidate',
 '_reduce',
 '_reduce_axis1',
 '_reindex_axes',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_shift_with_freq',
 '_should_reindex_frame_op',
 '_slice',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'sparse',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [27]:
dict_people = {
    'names': ['A', 'B', 'C', 'D'],
    'age': [28, 38, 35, 44],
    'city': ['Barcelona', 'Tarragona', 'Lleida', 'Girona'],
    'sibilings': [1,2,4,0]}

dict_people

{'names': ['A', 'B', 'C', 'D'],
 'age': [28, 38, 35, 44],
 'city': ['Barcelona', 'Tarragona', 'Lleida', 'Girona'],
 'sibilings': [1, 2, 4, 0]}

In [28]:
rows = ['student 1', 'student 2', 'student 3', 'student 4']
df = pd.DataFrame(data=dict_people, index= rows)

df

          names  age       city  sibilings
student 1     A   28  Barcelona          1
student 2     B   38  Tarragona          2
student 3     C   35     Lleida          4
student 4     D   44     Girona          0

In [29]:
#show all methods
df.describe(include='all')

       names        age       city  sibilings
count      4   4.000000          4   4.000000
unique     4        NaN          4        NaN
top        A        NaN  Barcelona        NaN
freq       1        NaN          1        NaN
mean     NaN  36.250000        NaN   1.750000
std      NaN   6.652067        NaN   1.707825
min      NaN  28.000000        NaN   0.000000
25%      NaN  33.250000        NaN   0.750000
50%      NaN  36.500000        NaN   1.500000
75%      NaN  39.500000        NaN   2.500000
max      NaN  44.000000        NaN   4.000000

In [30]:
#show first row
df.head(1)

          names  age       city  sibilings
student 1     A   28  Barcelona          1

In [31]:
#show las 3 rows
df.tail(3)

          names  age       city  sibilings
student 2     B   38  Tarragona          2
student 3     C   35     Lleida          4
student 4     D   44     Girona          0

In [32]:
#summary of ofject, including memory usage (why my programming is slow?)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, student 1 to student 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   names      4 non-null      object
 1   age        4 non-null      int64
 2   city       4 non-null      object
 3   sibilings  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes

In [33]:
#switch columns into rows, and rows into columns (transposing DataFrame)
df.T

           student 1  student 2 student 3 student 4
names              A          B         C         D
age               28         38        35        44
city       Barcelona  Tarragona    Lleida    Girona
sibilings          1          2         4         0

In [34]:
dict_cars = { 'brand': ['Honda Civic', 'Toyota Corolla', 'Ford Focus', 'Audi A4'],
            'price': [22000, 25000, 27000, 38000],
            'year': [2015, 2013, 2018, 2018]}

df_cars = pd.DataFrame(dict_cars)
df_cars

            brand  price  year
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013
2      Ford Focus  27000  2018
3         Audi A4  38000  2018

In [36]:
#sort by column name (not column values)
df_cars.sort_index(axis=1)

            brand  price  year
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013
2      Ford Focus  27000  2018
3         Audi A4  38000  2018

In [37]:
#reverse column names
df_cars.sort_index(axis=1, ascending=False)

   year  price           brand
0  2015  22000     Honda Civic
1  2013  25000  Toyota Corolla
2  2018  27000      Ford Focus
3  2018  38000         Audi A4

In [38]:
df_cars.sort_index(axis=0, ascending=False)

            brand  price  year
3         Audi A4  38000  2018
2      Ford Focus  27000  2018
1  Toyota Corolla  25000  2013
0     Honda Civic  22000  2015

In [39]:
df_cars.sort_values(by=['price'])

            brand  price  year
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013
2      Ford Focus  27000  2018
3         Audi A4  38000  2018

In [40]:
df_cars.sort_values(by=['year'], ascending=False)

            brand  price  year
2      Ford Focus  27000  2018
3         Audi A4  38000  2018
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013

In [41]:
#first sort by year and then, by price
df_cars.sort_values(by=['year', 'price'])

            brand  price  year
1  Toyota Corolla  25000  2013
0     Honda Civic  22000  2015
2      Ford Focus  27000  2018
3         Audi A4  38000  2018

In [43]:
#Missing data (NaN)
data = [{'a': 2, 'b':3, 'c':4, 'd':1},
       {'a':1, 'd':2, 'e':3, 'b':1}]

df_2 = pd.DataFrame(data)
df_2

   a  b    c  d    e
0  2  3  4.0  1  NaN
1  1  1  NaN  2  3.0

In [44]:
#delete rows and columns that have at least one NaN
df_2.dropna()

Empty DataFrame
Columns: [a, b, c, d, e]
Index: []

In [49]:
#delete only columns that have atleast one NaN
df_2.dropna(axis='columns') #or df_2.dropna(axis='1)

   a  b  d
0  2  3  1
1  1  1  2

In [47]:
#delete only rows that have atleast one NaN
df_2.dropna(axis='index') #or df_2.dropna(axis=0)

Empty DataFrame
Columns: [a, b, c, d, e]
Index: []

In [50]:
df_nan = pd.DataFrame(data, columns=['brand', 'price', 'year',1,2]) 
df_nan

   brand  price  year   1   2
0    NaN    NaN   NaN NaN NaN
1    NaN    NaN   NaN NaN NaN

In [52]:
#only delete is every element in a row or column is NaN
df_nan.dropna(how='all')

Empty DataFrame
Columns: [brand, price, year, 1, 2]
Index: []

In [53]:
#only delete if every element in a column is NaN
df_nan.dropna(how='all', axis=1)

Empty DataFrame
Columns: []
Index: [0, 1]

In [54]:
#the dataFrame is not delete, it's keeped in memory
df_nan

   brand  price  year   1   2
0    NaN    NaN   NaN NaN NaN
1    NaN    NaN   NaN NaN NaN

In [55]:
df_nan.dropna(thresh=3) #delete rows with at least 3 NaN values

Empty DataFrame
Columns: [brand, price, year, 1, 2]
Index: []

In [57]:
df_2

   a  b    c  d    e
0  2  3  4.0  1  NaN
1  1  1  NaN  2  3.0

In [58]:
df_2.dropna(thresh=3)

   a  b    c  d    e
0  2  3  4.0  1  NaN
1  1  1  NaN  2  3.0

In [60]:
df_2.isna()

       a      b      c      d      e
0  False  False  False  False   True
1  False  False   True  False  False